store/app/views/user_profiles/_basic.html.haml

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 2]]
---
              %strong= model_class.human_attribute_name(:work_city) + ':'
              = @user_profile.work_city.nil? ? '' : City.find(@user_profile.work_city).name
            .span4

SELECT "educations".* FROM "educations" WHERE "educations"."id" = ? LIMIT 1  [["id", 1]]
SELECT "professions".* FROM "professions" WHERE "professions"."id" = ? LIMIT 1  [["id", 1]]
---
              %strong= model_class.human_attribute_name(:education) + ':'
              = @user_profile.education.nil? ? '' : Education.find(@user_profile.education).name
            .span4
              %strong= model_class.human_attribute_name(:profession) + ':'
              = @user_profile.profession.nil? ? '' : Profession.find(@user_profile.profession).name
            .span4