store/ctm/app/controllers/friendships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def new_friend_request
    @friend = User.find(params[:friend_id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def create_friend_request
    debugger
    to_user = User.find(params[:friend_id])

SELECT "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new_decline_friends_request
    @f_req = FriendRequest.find(params[:friend_request_id])