store/ctm/app/controllers/users_controller.rb

  def index
    puts ">>>>>>>>>>>>>>>>>>>>>>>>>>>"
    puts current_user
    puts current_user.email
    puts current_user.gender? ? "MALE" : "FEMALE"
    puts "<<<<<<<<<<<<<<<<<<<<<<<"
    @users = User.where("gender = ? and id != ?",!current_user.gender,current_user.id).all
---
SELECT "users".* FROM "users" WHERE (gender = 't' and id != 1)