store/ctm/app/views/friendships/index.html.haml

SELECT "accepteds".* FROM "accepteds" WHERE "accepteds"."user_id" = 1
---
  %tbody
    - current_user.accepteds.each do |accepted|